Table of Contents
 Class DappedEnd
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of dapped end in IDEA StatiCa Detail
public class DappedEnd : OpenElementId
Inheritance
object
OpenObject
OpenElementId
DappedEnd
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 DappedEnd()
Constructor
public DappedEnd()
Properties
 DappedEndHaunch
Type of haunch on dapped end
public DappedEndHaunchType DappedEndHaunch { get; set; }
Property Value
DappedEndHaunchType
 GeomId
Id representing geometrical parts of Detail
public int GeomId { get; set; }
Property Value
int
 Haunch
Haunch size of dapped end
public double Haunch { get; set; }
Property Value
double
 Height
Height of dapped end
public double Height { get; set; }
Property Value
double
 MasterComponent
Master component
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterPoint
Insert point 0 - 1
public int MasterPoint { get; set; }
Property Value
int
 Outline
Outline of dapped end
public ReferenceElement Outline { get; set; }
Property Value
ReferenceElement
 Position
Offset between MasterPoint and InsertPoint
public Vector3D Position { get; set; }
Property Value
Vector3D
 Rotation
Rotation of dapped end
public double Rotation { get; set; }
Property Value
double
 Width
Width of dapped end
public double Width { get; set; }
Property Value
double
 Edit this page